import 'package:Nahvino/core/Utils/Text/Text.dart';
import 'package:flutter/material.dart';

class PrivacyScreen extends StatelessWidget {
  const PrivacyScreen({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: Colors.cyan.shade800,
        title: Callout(text: "سیاست گذاریِ حریم خصوصی اپلیکیشن نحوینو"),
      ),
      body: SafeArea(
        child: SingleChildScrollView(
          child: Padding(
            padding: const EdgeInsets.all(12.0),
            child: Callout(
                color: Colors.black,
                textAlign: TextAlign.right,
                text:
                    "داشتن حق انتخاب فرد در آشکار ساختن یا نساختنِ خود و اطلاعاتش در برابر فرد یا افراد دیگر حریم شخصی یا خصوصی قلمداد می شود که نحوینو به عنوان یک پیام رسان ایرانی ارزش بسیاری برای این موضوع قائل است.نحوینو برخی اطلاعات و داده های شما کاربران در سرتاسر دنیا را جمع آوری میکند تا بتواند بهترین خدمات را در اختیارتان قرار دهد. \nبرای مثال دربارهٔ شماره تلفن، نام، آدرس ایمیل و همچنین تصویری برای پروفایل سؤال میکند که نمایه ای از خود برای حساب کاربریِ تان داشته باشید.  \nباید بدانید حتی به شماره تلفن هم برای ثبت نام نیاز ندارید و نام کاربری به سلیقه شما برای تشخیص شما به عنوان دارندهٔ این حساب کاربری الزامی شمرده می شوند.\nاطلاعات مربوط به دستگاه هایی که زمان ورود به حساب کاربری تان از آنها استفاده می شود به صورت خودکار در سیستم ثبت می شوند تا به منظور حفظ حریم خصوصی تان و جلوگیری از سوءاستفاده های احتمالی، دستگاه های ناشناس و غیرمجاز را شناسایی کرده و متوقف کنید.\nارسال و دریافت پیام در قالب های مختلف، ایجاد تماس صوتی، ساختن صفحات چت گروهی و کانال، یافتن گروه های عمومی خدمات ارزندهٔ نحوینو محسوب می شوند که هر یک از آنها بنا به خواست کاربر در حوزهٔ حریم خصوصی می توانند به صورت مجزا تنظیم شوند.\nپیام های متنی در نحوینو به صورت رمزنگاری شده بر روی سرورهای نحوینو برای همیشه ذخیره و نگهداری می شوند (به دلیل بازگرداندن آرشیو و امکان افزوده شدن چند دستگاه به حساب کاربری) و در صورتی که هر دو کاربر مورد نظر یعنی ارسال کننده و گیرندهٔ پیام حذف گفتگو و یا پاکسازی تاریخچه را انتخاب کنند و یا هر دو حساب کاربری خود را حذف کنند، این پیام های متنی از روی سرورها نیز پاک خواهند شد؛ اما پیام های غیرمتنی شامل فایل ها برای همیشه بر روی بستر ابری  نحوینو حفظ و نگهداری می شوند ."),
          ),
        ),
      ),
    );
  }
}
